Table of Contents
 Class FatigueLoading
Namespace
IdeaRS.OpenModel.Concrete.Load
Assembly
IdeaRS.OpenModel.dll
Fatigue loading
public class FatigueLoading
Inheritance
object
FatigueLoading
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 FatigueLoading()
Constructor
public FatigueLoading()
Properties
 MaxLoading
Max. cyclic loading
public LoadingULS MaxLoading { get; set; }
Property Value
LoadingULS
 MinLoading
Min. cyclic loading
public LoadingULS MinLoading { get; set; }
Property Value
LoadingULS
 Edit this page